# Task 4 (SQL) - Assignment 
### Name: Hammond Helen
### Date: February 11th 2023

### 17.2 Relational Databases and Structured Query Language (SQL)

Relational database management systems (RDBMSs) store data in tables and define relationships among the tables. Structured Query Language (SQL) is used almost universally with relational database systems to manipulate data and perform queries, which request information that satisfies given criteria

### Tables, Rows and Columns
A relational database is a logical table-based representation of data that allows the data to be accessed without consideration of its physical structure.

Tables are composed of rows, each describing a single entity. Here, each row represents one employee. Rows are composed of columns containing individual attribute values

### Selecting Data Subsets
Different database users are often interested in different data and different relationships among the data. Most users require only subsets of the rows and columns. Queries specify which subsets of the data to select from a table. You use Structured Query Language (SQL) to define queries.

### SQLite
The code examples in the rest of Section 17.2 use the open-source SQLite database management system that’s included with Python, but most popular database systems have Python support. Each typically provides a module that adheres to Python’s Database Application Programming Interface (DB-API), which specifies common object and method names for manipulating any database.

Follow the instructions in 17.2.1 (starting page 730)  
Don't work in interactive mode - use a notebook  
IMPORTANT: create the table using the books.sql script provided with the author files. See [https://github.com/pdeitel/IntroToPython/blob/master/examples/ch17/sql/books.sqlLinks](https://github.com/pdeitel/IntroToPython/blob/master/examples/ch17/sql/books.sqlLinks) to an external site.  
Import the sqlite3 module and use the connect function to create a connection to your database.

### Importing SQLite module

In [1]:
import sqlite3

### Connecting to the Database in Python

In [2]:
connection = sqlite3.connect('books.db')

## 17.2.1 A `books` Database

### Creating the `books` Database

In [3]:
with open('books.sql','r') as f:
    connection.executescript(f.read())

After running the script, there should be 3 tables: authors, author\_ISBN, and titles.  
Import pandas as pd

In [4]:
import pandas as pd

Use pd options.display to set the max\_columns to 10

In [5]:
pd.options.display.max_columns = 10

Use pd read\_sql fuction to select everything (\*) from the authors table, then the titles table, then the author\_ISBN table.

### `authors` Table

### Viewing the `authors` Table’s Contents

In [6]:
pd.read_sql('SELECT * FROM authors', connection, index_col='id')

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

### `titles` Table

### Viewing the `titles` Table’s Contents

In [7]:
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

### `author_ISBN` Table

### Selecting the `authors_ISBN` Table’s Contents into a dataframe

In [8]:
df_authors_isbn = pd.read_sql('SELECT * FROM author_ISBN', connection)

### Viewing the top 10 `authors_ISBN` Table’s Contents

In [9]:
df_authors_isbn.head(10)

   id        isbn
0   1  0134289366
1   2  0134289366
2   5  0134289366
3   1  0135404673
4   2  0135404673
5   1  0132151006
6   2  0132151006
7   3  0132151006
8   1  0134743350
9   2  0134743350

### Entity-Relationship (ER) Diagram

### SQL Keywords

##

Complete 17.2.2 SELECT (1 query)

# SECTION 1. `SELECT` Queries

Here, we are displaying the first and last name of the auhors. We do this by specifying the column names

In [10]:
pd.read_sql("""
                SELECT 
                    first,
                    last 
                FROM 
                    authors""", connection)

       first    last
0       Paul  Deitel
1     Harvey  Deitel
2      Abbey  Deitel
3        Dan   Quirk
4  Alexander    Wald

## Self Check
A **foreign** key is a field in a table for which every entry has a unique value in another table and where the field in the other table is the primary key for that table.

(TRUE/FALSE) Every foreign-key value must appear as another table’s primary-key value so the DBMS can ensure that the foreign-key value is valid—this is known as the Rule of Entity Integrity.

Answer: **False**. This is known as the Rule of Referential Integrity. The Rule of Entity Integrity states that every row must have a primary-key value, and that value must be unique in the table.

Complete 17.2.3 WHERE (3 queries)

# SECTION 2. `WHERE` Clause

SQL’s WHERE clause specifies a query’s selection criteria. Let’s select the title, edition and copyright for all books with copyright years greater than 2016. String values in SQL queries are delimited by single (') quotes, as in '2016':

In [11]:
pd.read_sql("""
                SELECT 
                    title, 
                    edition, 
                    copyright 
                FROM 
                    titles 
                WHERE 
                    copyright > '2016'""", connection)

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018
2       Visual C# How to Program        6      2017
3             C++ How to Program       10      2017
4         Android How to Program        3      2017

### Pattern Matching: Zero or More Characters 
A pattern that contains the percent (%) wildcard character searches for strings that have zero or more characters at the percent character’s position in the pattern. For example, let’s locate all authors whose last name starts with the letter D:

In [12]:
pd.read_sql("""
                SELECT 
                    id, 
                    first, 
                    last 
                FROM 
                    authors 
                WHERE 
                    last LIKE 'D%'""", connection, index_col=['id'])

     first    last
id
1     Paul  Deitel
2   Harvey  Deitel
3    Abbey  Deitel

### Pattern Matching: Any Character
An underscore (_) in the pattern string indicates a single wildcard character at that position. Let’s select the rows of all the authors whose last names start with any character, followed by the letter b, followed by any number of additional characters (specified by %):

In [13]:
pd.read_sql("""
                SELECT 
                    id, 
                    first, 
                    last 
                FROM 
                    authors 
                WHERE  
                    first LIKE '_b%'""", connection, index_col=['id'])

    first    last
id
3   Abbey  Deitel

## Self Check
SQL keyword **WHERE** is followed by the selection criteria that specify the records to select in a query.

Complete 17.2.4 ORDER BY (4 queries)

# SECTION 3. `ORDER BY` Clause

The ORDER BY clause sorts a query’s results into ascending order (lowest to highest) or descending order (highest to lowest), specified with ASC and DESC, respectively. The default sorting order is ascending, so ASC is optional. Let’s sort the titles in ascending order:

In [14]:
pd.read_sql("""
                SELECT 
                    title 
                FROM 
                    titles 
                ORDER BY 
                    title ASC""", connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

### Sorting By Multiple Columns
To sort by multiple columns, specify a comma-separated list of column names after the ORDER BY keywords. Let’s sort the authors’ names by last name, then by first name for any authors who have the same last name:

In [15]:
pd.read_sql("""
                SELECT 
                    id,
                    first,
                    last
                FROM 
                    authors 
                ORDER BY 
                    last, first""", connection, index_col=['id'])

        first    last
id
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel
4         Dan   Quirk
5   Alexander    Wald

The sorting order can vary by column. Let’s sort the authors in descending order by last name and ascending order by first name for any authors who have the same last name:

In [16]:
pd.read_sql("""
                SELECT 
                    id,
                    first,
                    last
                FROM 
                    authors 
                ORDER BY 
                    last DESC, first ASC""", connection, index_col=['id'])

        first    last
id
5   Alexander    Wald
4         Dan   Quirk
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel

              

### Combining the `WHERE` and `ORDER BY` Clauses

The WHERE and ORDER BY clauses can be combined in one query. Let’s get the isbn, title, edition and copyright of each book in the titles table that has a title ending with 'How to Program' and sort them in ascending order by title.

In [17]:
pd.read_sql("""
                SELECT 
                    isbn,
                    title,
                    edition,
                    copyright
                FROM 
                    titles
                WHERE
                    title LIKE '%How to Program' 
                ORDER BY
                    title ASC""", connection)

         isbn                             title  edition copyright
0  0134444302            Android How to Program        3      2017
1  0133976890                  C How to Program        8      2016
2  0134448235                C++ How to Program       10      2017
3  0132151006     Internet & WWW How to Program        5      2012
4  0134743350               Java How to Program       11      2018
5  0133406954  Visual Basic 2012 How to Program        6      2014
6  0134601548          Visual C# How to Program        6      2017
7  0136151574         Visual C++ How to Program        2      2008

## Self Check
SQL keyword **ORDER BY** specifies the order in which records are sorted in a query.

Complete 17.2.5 INNER JOIN (1 query)

# SECTION 4. `INNER JOIN` Statement

## Merging Data from Multiple Tables:

You can merge data from multiple tables, referred to as joining the tables, with INNER JOIN. Let’s produce a list of authors accompanied by the ISBNs for books written by each author—because there are many results for this query, we show just the head of the result:

In [18]:
pd.read_sql("""
                SELECT 
                    a.id,
                    first,
                    last,
                    isbn
                FROM 
                    authors a
                INNER JOIN
                    author_ISBN ai
                ON
                    a.id = ai.id
                ORDER BY
                    last, first""", connection, index_col=['id']).head()

     first    last        isbn
id
3    Abbey  Deitel  0132151006
3    Abbey  Deitel  0133406954
2   Harvey  Deitel  0134289366
2   Harvey  Deitel  0135404673
2   Harvey  Deitel  0132151006

The INNER JOIN’s ON clause uses a primary-key column in one table and a foreign-key column in the other to determine which rows to merge from each table. 

Note the syntax a.id (table_alias.column_name) in the ON clause. This qualified name syntax is required if the columns have the same name in both tables.


### Self Check
A **qualified name** specifies the fields from multiple tables that should be compared to join the tables.

Complete 17.2.6 INSERT INTO (2 queries)

# SECTION 5. `INSERT INTO` Statement

To this point, you’ve queried existing data. Sometimes you’ll execute SQL statements that modify the database. To do so, you’ll use a sqlite3 Cursor object, which you obtain by calling the Connection’s cursor method:

In [19]:
cursor = connection.cursor()

The pandas method read_sql actually uses a Cursor behind the scenes to execute queries and access the rows of the results.

The INSERT INTO statement inserts a row into a table. Let’s insert a new author named Sue Red into the authors table by calling Cursor method execute, which executes its SQL argument and returns the Cursor:

In [20]:
cursor = cursor.execute("""
                            INSERT INTO 
                                authors (first, last)
                            VALUES 
                                ('Sue', 'Red')""")

To confirm the insertion of a new row, let’s query the authors table’s contents:

In [21]:
pd.read_sql("""
                SELECT 
                    id, 
                    first, 
                    last 
                FROM 
                    authors""", 
             connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red

Complete 17.2.7 UPDATE (2 queries)

### Note Regarding Strings That Contain Single Quotes
SQL delimits strings with single quotes ('). A string containing a single quote, such as O’Malley, must have two single quotes in the position where the single quote appears (e.g., 'O''Malley'). The first acts as an escape character for the second. Not escaping single-quote characters in a string that’s part of a SQL statement is a SQL syntax error.

# SECTION 6. `UPDATE` Statement
### An UPDATE statement modifies existing values. 

The UPDATE keyword is followed by the table to update, the keyword SET and a comma-separated list of column_name = value pairs indicating the columns to change and their new values.

To make a change to only one row, it’s best to use the row’s unique primary key in the WHERE clause

In [22]:
cursor = cursor.execute("""
                            UPDATE 
                                authors 
                            SET 
                                last = 'Black'
                            WHERE 
                                last= 'Red' 
                            AND 
                                first='Sue'""")

For statements that modify the database, the Cursor object’s rowcount attribute contains an integer value representing the number of rows that were modified. If this value is 0, no changes were made.

In [23]:
cursor.rowcount

1

In [24]:
pd.read_sql('SELECT id, first, last FROM authors', 
             connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue   Black

Complete 17.2.8 DELETE FROM (2 queries)

# SECTION 7. `DELETE FROM` Statement
A SQL DELETE FROM statement removes rows from a table. The optional WHERE clause determines which rows to delete. If WHERE is omitted, all the table’s rows are deleted. Let’s remove Sue Black from the authors table using her author ID:

In [25]:
cursor = cursor.execute('DELETE FROM authors WHERE id = 6')

The Cursor object’s rowcount to show the changes made.

In [26]:
cursor.rowcount

1

Here’s the authors table after the DELETE operation:

In [27]:
pd.read_sql('SELECT id, first, last FROM authors', 
             connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

Final Results, SELECT \* from each table and display the final state of each of the 3 tables.

# SECETION 8. `authors`, `titles`, `author_ISBN` Tables' Final Contents

### Viewing the final `authors` table’s contents

In [28]:
pd.read_sql('SELECT * FROM authors', 
             connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

### Viewing the final `titles` table’s contents

In [29]:
pd.read_sql('SELECT * FROM titles', 
             connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

### Viewing the final `author_ISBN` table’s contents

In [30]:
pd.read_sql('SELECT * FROM author_ISBN', 
             connection)

    id        isbn
0    1  0134289366
1    2  0134289366
2    5  0134289366
3    1  0135404673
4    2  0135404673
5    1  0132151006
6    2  0132151006
7    3  0132151006
8    1  0134743350
9    2  0134743350
10   1  0133976890
11   2  0133976890
12   1  0133406954
13   2  0133406954
14   3  0133406954
15   1  0134601548
16   2  0134601548
17   1  0136151574
18   2  0136151574
19   4  0136151574
20   1  0134448235
21   2  0134448235
22   1  0134444302
23   2  0134444302

Required: Use Section headings in your Markdown to make it clear that each of these 8 sections are shown in your notebook. They should be numbered 1-8 and include the SQL keyword shown above. Use a heading before your the final results showing all 3 tables as well.

### Closing the Database
When you no longer need access to the database, you should call the Connection’s close method to disconnect from the database.

```
connection.close()
```